---
kind: type
id: T:Autodesk.Revit.DB.KeyBasedTreeEntryTable
source: html/c5d3e9d9-0221-520b-6163-9843db20d5ea.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryTable

KeyBasedTreeEntryTable represents the collection of key-based tree entries for a document.

## Syntax (C#)
```csharp
public class KeyBasedTreeEntryTable : Element
```